In [2]:
import pandas as pd
import numpy as np

In [3]:
maasSozluk = {"Isim":["Ali","Ayse","Fatma","Mehmet"],
            "Departman":["Yazilim","Satis","Finans","Yazilim"],
              "Maas":[10000,12000,9000,15000]}

In [4]:
maasdf = pd.DataFrame(maasSozluk)
maasdf

     Isim Departman   Maas
0     Ali   Yazilim  10000
1    Ayse     Satis  12000
2   Fatma    Finans   9000
3  Mehmet   Yazilim  15000

In [5]:
maasdf["Departman"].unique()  # Departmanların benzersiz değerlerini alır

array(['Yazilim', 'Satis', 'Finans'], dtype=object)

In [6]:
maasdf["Departman"].nunique() # Departmanların benzersiz sayısını alır

3

In [7]:
maasdf["Departman"].value_counts()

Departman
Yazilim    2
Satis      1
Finans     1
Name: count, dtype: int64

In [8]:
def bruttenNete(maas):
    return maas * 0.7
maasdf["Net Maas"] = maasdf["Maas"].apply(bruttenNete)
maasdf

     Isim Departman   Maas  Net Maas
0     Ali   Yazilim  10000    7000.0
1    Ayse     Satis  12000    8400.0
2   Fatma    Finans   9000    6300.0
3  Mehmet   Yazilim  15000   10500.0

In [9]:
maasdf.isnull() # DataFrame'deki eksik değerleri kontrol eder

    Isim  Departman   Maas  Net Maas
0  False      False  False     False
1  False      False  False     False
2  False      False  False     False
3  False      False  False     False

### pivot table

In [10]:
yeniVeri = {"Karekter Sinifi": ["South park", "South park", "Simpson", "Simpson"],
            "Karekter Ismi": ["Cartman", "Kenny", "Homer", "Bart"],
            "Yas": [10, 11, 40, 12],}

In [11]:
karakterDf = pd.DataFrame(yeniVeri)
karakterDf

  Karekter Sinifi Karekter Ismi  Yas
0      South park       Cartman   10
1      South park         Kenny   11
2         Simpson         Homer   40
3         Simpson          Bart   12

In [12]:
karakterDf.pivot_table(values="Yas",index=["Karekter Sinifi","Karekter Ismi"])

                                Yas
Karekter Sinifi Karekter Ismi
Simpson         Bart           12.0
                Homer          40.0
South park      Cartman        10.0
                Kenny          11.0

In [13]:
yeniVeri1 = {"Karekter Sinifi": ["South park", "South park", "Simpson", "Simpson", "Simpson"],
            "Karekter Ismi": ["Cartman", "Kenny", "Homer", "Bart" ,"Bart"],
            "Yas": [10, 11, 40, 12,10]}

In [14]:
karakterDf1 = pd.DataFrame(yeniVeri1)
karakterDf1

  Karekter Sinifi Karekter Ismi  Yas
0      South park       Cartman   10
1      South park         Kenny   11
2         Simpson         Homer   40
3         Simpson          Bart   12
4         Simpson          Bart   10

In [15]:
karakterDf1.pivot_table(values="Yas",index=["Karekter Sinifi","Karekter Ismi"]) # Pivot table, aynı indekse sahip olan değerleri gruplar ve işlemler yapar. 
# bart karakterinin iki farklı yaşı var. Bu durumda pivot table, bu iki değeri gruplar ve ortalamasını alır.

                                Yas
Karekter Sinifi Karekter Ismi
Simpson         Bart           11.0
                Homer          40.0
South park      Cartman        10.0
                Kenny          11.0

In [16]:
pivot_df = karakterDf1.pivot_table(
    values="Yas",
    index=["Karekter Sinifi", "Karekter Ismi"],
    aggfunc="sum"  # np.sum yerine string olarak 'sum' kullanıyoruz
)

pivot_df

                               Yas
Karekter Sinifi Karekter Ismi
Simpson         Bart            22
                Homer           40
South park      Cartman         10
                Kenny           11

In [ ]:
maasdf.loc[:,"Isim":"Maas"] # loc ile satır ve sütunları seçebiliriz. son sütun dahil edilir.

     Isim Departman   Maas
0     Ali   Yazilim  10000
1    Ayse     Satis  12000
2   Fatma    Finans   9000
3  Mehmet   Yazilim  15000